ILLVAN/PSoC_AUDIO_MIDI_project/PSoC_Audio_MIDI/PSoC_Audio_MIDI.cydsn/codegentemp/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.4
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2020 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "isr_checkMode.h"
#include "Timer_Mode.h"
#include "Pin_Dice_2_aliases.h"
#include "Pin_Dice_2.h"
#include "Pin_Dice_1_aliases.h"
#include "Pin_Dice_1.h"
#include "Pin_Dice_LED_2_aliases.h"
#include "Pin_Dice_LED_2.h"
#include "Pin_Dice_LED_1_aliases.h"
#include "Pin_Dice_LED_1.h"
#include "UART_1.h"
#include "Vout_2_aliases.h"
#include "Vout_2.h"
#include "Clock_1.h"
#include "WaveDAC8_1.h"
#include "ADC_isr.h"
#include "analogADC.h"
#include "analogBut_isr.h"
#include "but2_isr_pos.h"
#include "analogBut_aliases.h"
#include "analogBut.h"
#include "analogY_aliases.h"
#include "analogY.h"
#include "analogX_aliases.h"
#include "analogX.h"
#include "but3_aliases.h"
#include "but3.h"
#include "but2_aliases.h"
#include "but2.h"
#include "but3_isr_neg.h"
#include "but3_isr_pos.h"
#include "but2_isr_neg.h"
#include "debouncerClock.h"
#include "but1_isr_neg.h"
#include "but1_isr_pos.h"
#include "but1_aliases.h"
#include "but1.h"
#include "analogMUX.h"
#include "Pin_EchoReturn_aliases.h"
#include "Pin_EchoReturn.h"
#include "Pin_EchoTrig_aliases.h"
#include "Pin_EchoTrig.h"
#include "Clock_Echo.h"
#include "Timer_Echo.h"
#include "isr_Echo.h"
#include "SDA_1_aliases.h"
#include "SDA_1.h"
#include "SCL_1_aliases.h"
#include "SCL_1.h"
#include "Clock_OLED.h"
#include "I2COLED.h"
#include "I2COLED_PVT.h"
#include "isr_updateESP.h"
#include "Timer_Display.h"
#include "UART_TOESP.h"
#include "Pin_OSZ2_aliases.h"
#include "Pin_OSZ2.h"
#include "WaveDAC8_2.h"
#include "Clock_2.h"
#include "Vout_1_aliases.h"
#include "Vout_1.h"
#include "Pin_OSZ1_aliases.h"
#include "Pin_OSZ1.h"
#include "Pin_OSZ1_LED_aliases.h"
#include "Pin_OSZ1_LED.h"
#include "Pin_OSZ2_LED_aliases.h"
#include "Pin_OSZ2_LED.h"
#include "UART_1_IntClock.h"
#include "WaveDAC8_1_Wave1_DMA_dma.h"
#include "WaveDAC8_1_Wave2_DMA_dma.h"
#include "WaveDAC8_1_VDAC8.h"
#include "WaveDAC8_1_BuffAmp.h"
#include "analogADC_AMux.h"
#include "analogADC_Ext_CP_Clk.h"
#include "analogADC_IRQ.h"
#include "analogADC_theACLK.h"
#include "UART_TOESP_IntClock.h"
#include "WaveDAC8_2_Wave1_DMA_dma.h"
#include "WaveDAC8_2_Wave2_DMA_dma.h"
#include "WaveDAC8_2_VDAC8.h"
#include "WaveDAC8_2_BuffAmp.h"
#include "core_cm3_psoc5.h"
#include "CyDmac.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cypins.h"
#include "cyPm.h"
#include "CySpc.h"
#include "cytypes.h"
#include "cy_em_eeprom.h"

/*[]*/

